verify/mutants/m6_wrong_sentinel_compare.patch
diff --git i/chronos/internal/callbackqueue.nim w/chronos/internal/callbackqueue.nim
index ffee89f..f566bd5 100644
--- i/chronos/internal/callbackqueue.nim
+++ w/chronos/internal/callbackqueue.nim
@@ -185,7 +185,7 @@ when defined(chronosDebug) and chronosUseSink:
     ## own generic-instantiation path does not hit this, so hoisting the
     ## check here is the fix, not a workaround for a real ambiguity in
     ## what's being asserted.
-    doAssert item == default(T),
+    doAssert item != default(T),
       "CallbackQueue: a vacated slot retained a non-nil ghost value after " &
       "popFirst() — a slot-vacating path bypassed the fused-move discipline"
 
