verify/mutants/m11_prependnogrow_guard_removed.patch
diff --git i/tonalli/internal/callbackqueue.nim w/tonalli/internal/callbackqueue.nim
index 621253f..5b03f39 100644
--- i/tonalli/internal/callbackqueue.nim
+++ w/tonalli/internal/callbackqueue.nim
@@ -149,8 +149,6 @@ proc prependNoGrow*[T](q: var CallbackQueue[T], item: tonalliSink T) =
   ## intended for re-inserting an item into a queue known to have
   ## spare capacity (e.g. re-inserting a sentinel at the front of an
   ## already-fully-drained batch).
-  doAssert not isFull(q.head, q.tail, q.data.len),
-    "CallbackQueue.prependNoGrow(): queue unexpectedly full"
   dec q.head
   let idx = slotIndex(q.head, q.data.len)
   q.data[idx] = item
