verify/mutants/m6_wrong_sentinel_compare.patch
diff --git i/chronos/internal/callbackqueue.nim w/chronos/internal/callbackqueue.nim
index 542dd6d..261635d 100644
--- i/chronos/internal/callbackqueue.nim
+++ w/chronos/internal/callbackqueue.nim
@@ -232,7 +232,7 @@ template popFirst*[T](q: var CallbackQueue[T]): T =
     # is fully elided when undefined, leaving the exact single-expression
     # form the barrier-count analysis above describes.
     let chronosPopped = chronosMoveSink(q.data[chronosQueueIdx])
-    doAssert q.data[chronosQueueIdx] == default(T),
+    doAssert q.data[chronosQueueIdx] != default(T),
       "CallbackQueue: a vacated slot retained a non-nil ghost value after " &
       "popFirst() — a slot-vacating path bypassed the fused-move discipline"
     chronosPopped
