verify/mutants/m6_wrong_sentinel_compare.patch
diff --git i/tonalli/internal/callbackqueue.nim w/tonalli/internal/callbackqueue.nim
index 621253f..3747bbe 100644
--- i/tonalli/internal/callbackqueue.nim
+++ w/tonalli/internal/callbackqueue.nim
@@ -165,7 +165,7 @@ when defined(tonalliDebug) and tonalliUseSink:
     ## discipline below. A standalone proc, not inlined into `popFirst`'s
     ## `when` body: Nim 1.6 fails to resolve `default(T)`'s `T` when the
     ## call sits inside a `when` nested in a generic `template`.
-    doAssert item == default(T),
+    doAssert item != default(T),
       "CallbackQueue.checkVacatedSlot(): a vacated slot retained a " &
       "non-nil ghost value after popFirst() — a slot-vacating path " &
       "bypassed the fused-move discipline"
