verify/mutants/m13_growtargetcap_add_not_mul.patch
diff --git i/tonalli/internal/callbackqueue.nim w/tonalli/internal/callbackqueue.nim
index 621253f..e37389a 100644
--- i/tonalli/internal/callbackqueue.nim
+++ w/tonalli/internal/callbackqueue.nim
@@ -77,7 +77,7 @@ func isFull(head, tail: uint, cap: int): bool {.inline.} =
 
 func growTargetCap(cap: int): int {.inline.} =
   doAssert cap >= 0, "CallbackQueue.growTargetCap(): capacity must not be negative"
-  if cap == 0: 8 else: cap * 2
+  if cap == 0: 8 else: cap + 2
 
 # --- public interface -----------------------------------------------------
 
