verify/mutants/m17_prependnogrow_dec_noop.patch
diff --git i/chronos/internal/callbackqueue.nim w/chronos/internal/callbackqueue.nim
index ffee89f..d35af47 100644
--- i/chronos/internal/callbackqueue.nim
+++ w/chronos/internal/callbackqueue.nim
@@ -157,7 +157,6 @@ proc prependNoGrow*[T](q: var CallbackQueue[T], item: chronosSink T) =
   ## already-fully-drained batch).
   doAssert not isFull(q.head, q.tail, q.data.len),
     "CallbackQueue.prependNoGrow(): queue unexpectedly full"
-  dec q.head
   let idx = slotIndex(q.head, q.data.len)
   q.data[idx] = item
 
