verify/mutants/m4_swapped_copymem_segments.patch
diff --git i/chronos/internal/callbackqueue.nim w/chronos/internal/callbackqueue.nim
index ffee89f..c115590 100644
--- i/chronos/internal/callbackqueue.nim
+++ w/chronos/internal/callbackqueue.nim
@@ -127,11 +127,11 @@ proc grow[T](q: var CallbackQueue[T]) =
   if n > 0:
     let startIdx = slotIndex(q.head, oldCap)
     let firstSeg = min(n, oldCap - startIdx)
-    copyMem(addr newData[0], addr q.data[startIdx], firstSeg * sizeof(T))
+    copyMem(addr newData[firstSeg], addr q.data[startIdx], firstSeg * sizeof(T))
     zeroMem(addr q.data[startIdx], firstSeg * sizeof(T))
     if firstSeg < n:
       let rest = n - firstSeg
-      copyMem(addr newData[firstSeg], addr q.data[0], rest * sizeof(T))
+      copyMem(addr newData[0], addr q.data[0], rest * sizeof(T))
       zeroMem(addr q.data[0], rest * sizeof(T))
   q.data = newData
   q.head = 0'u
