verify/mutants/m8_queuelen_guard_offbyone.patch
diff --git i/chronos/internal/callbackqueue.nim w/chronos/internal/callbackqueue.nim
index ffee89f..6a8f7c1 100644
--- i/chronos/internal/callbackqueue.nim
+++ w/chronos/internal/callbackqueue.nim
@@ -85,7 +85,7 @@ proc queueLen(head, tail: uint): int {.inline.} =
 
 proc isFull(head, tail: uint, cap: int): bool {.inline.} =
   let n = queueLen(head, tail)
-  doAssert n >= 0 and n <= cap,
+  doAssert n >= 0 and n < cap,
     "CallbackQueue: length invariant violated - `tail - head` " &
     "(mod 2^wordsize) must never exceed capacity"
   n >= cap
